/*======================================================================

  ■■■실행 흐름의 컨트롤 (제어문)■■■
 
  - 반복문 (while문)실습 및 '관찰'      반복문은 덜 도는게 좋다
  - 코드 작성 후 컴파일 전 결과 예측하기★★★★★★
  - 반복문 익숙해 빨리지는 방법임
  
======================================================================*/

//	○과제
//	사용자로부터 임의의 정수를 입력받아
//	1부터 입력받은 그 정수까지의
//	전체 합과, 짝수의 합과, 홀수의 합을
//	각각 결과값으로 출력하는 프로그램을 구현한다.

//실행 예)
//임의의 정수 입력 : 284
//>> 1 ~ 284 까지 정수의 합 : xxxx
//>> 1 ~ 284 까지 짝수의 합 : xxxx
//>> 1 ~ 284 까지 홀수의 합 : xxxx
// 계속하려면 아무 키나......

public class Test053
{
	public static void main(String[] args)
	{
		
	}
}
