/*
======================================================================

■■■연산자(Operator)■■■
-비트 단위 연산자
-비트 쉬프트 연산자(모든 연산을 통틀어 가장 빠른 속도)
======================================================================

*/

public class Test025
{
	public static void main(String[] args)
	{
		int x = 128;		//00000000 00000000 00000000 10000000

		System.out.printf("x << 3 : %d%n",x << 3); //반대는 >>>
		//x의 비트열을 3칸 이동켜라
		//00000000 00000000 00000010 00000000
		System.out.printf("x * 8 : %d%n", x * 8);
		//--==>>x << 3 : 1024
		//		x * 8 : 1024
		System.out.printf("x >> 3: %d%n" , x >> 3);
						//	>>는 특별한케이스
		//00000000 00000000 00000000 00010000
		System.out.printf("x / 8 : %d%n", x / 8);
		//--==>> x >> 3 : 16
		//		 x / 8 : 16
		System.out.printf("x < 24 : %d%n" , x << 24);
		//--==>>  x < 24 : -2147483648
		System.out.printf("x << 26 : %d%n" , x << 26);
		System.out.printf("x << 26 : %d%n" , x << 26);
		System.out.printf("x << 27 : %d%n" , x << 27);
		System.out.printf("x << 31 : %d%n" , x << 31);
		//--==>>x << 25 : 0
		//x << 25 : 0
		System.out.printf("x << 32 : %d%n", x <<32);



	}
}
/* 실행결과 
x << 3 : 1024
x * 8 : 1024
x >> 3: 16
x / 8 : 16
x < 24 : -2147483648
x << 26 : 0
x << 26 : 0
x << 27 : 0
x << 31 : 0
x << 32 : 128
계속하려면 아무 키나 누르십시오 . . .

*/