
/*======================================================================

■■■실행 흐름의 컨트롤 (제어문)■■■
-if문
-if ~else 문
  
======================================================================*/

/*과제
사용자로부터 임의의 문자를 하나 이력받아
대문자이면 소문자로, 소문자이면 대문자로
알파벳이 아닌 기타 문자이면 입력 오류 퍼리하는
프로그램을 구형

실행예)
한 문자 입력 : A
A → a
계속하려면 아무 키나 누르...

한 문자 입력 : b
b → B
계속하려면 아무 키나 누르...

한 문자 입력 : 3
입력 오류~!!!

계속하려면 아무 키나 누르...
*/



public class Test040
{
	public static void main(String[] args)
	{
	
	}

}
